/*
 class => برای دسته بندی عناصر و آیتم های مرتبط به یکدیگر استفاده می شود

 کاربرد ها در تایپ اسکریپت => 
 1.برای تعریف کامپوننت ها
 2.برای تعریف سرویس ها
 3.برای تعریف پایپ ها
 4.برای تعریف دایرکتیو
 5.برای تعریف مدل ها
 6.....

 اجزای داخلی یک کلاس =>
 1.constructor : سازنده کلاس که در زمان ایجاد نمونه از کلاس کدهای داخل آن اجرا می شود
    
 کاربرد در تایپ اسکریپت => 
    برای مقدار دهی اولیه و مهم تر اینکه برای بحث تزریق وابستگی ها استفاده می شود => Dependency Injection

 2.Property : برای تعریف ویژگی های یک کلاس مانند عنوان - مقدار شمارنده

 3.Fucntion (Method) : توابع
  کاربرد =>
    برای نوشتن کارهایی که قرار است در کلاس براساس اتفاق های خاص رخ دهد

 4.extends or implement  => ارث بری از اینترفیس یا توسعه عناصر یک کلاس پدر






*/