/*
 Function => به منظور کار خاصی نوشته و در محل های مورد نیاز فراخوانی می شود

 اجزای یک تابع =>
 1.Name => نام تابع باید یک نام مرتبط و کامل باشد
 2.Paremeters => پارامتر های ورودی که در بدنه تابع به آنها نیاز داریم
 3.Return Type => مقدار خروجی تابع بهتر است مشخص شود   
 4.Function Body => بدنه تابع که شامل کدهای مورد نیاز برای اجرا در زمان فراخوانی تابع است
 5.return => برای خروج از تابع با مقدار و یا بدون مقدار
 6.Scope => محدوده دیده شدن => private, public,...
 
 getProductInfo(id:number):Product{
    ...
    return model;
    return;
 }











*/